{"template":"/home/maxiee/Code/Blog/maxiee.github.io/src/pages/post","sharedHashesByProp":{},"data":{"post":{"name":"那些年，我早该明白的道理（二）——22 岁才学会学习的我","desc":"在本文中，我回顾了自己学习方法发展的心路历程，以及其中的一些心得与教训。应试教育把我坑惨了，好在最后我又把自己救回来了。","type":"md","link":"ShouldHaveKnown2md","create":"2019-03-07","filename":"ShouldHaveKnown2.md"},"content":"## 前言\n\n从小学起我对学习就有深深的误区。\n\n在我看来，学习就是为了考试，而考试就是一个像现在吃鸡这样的游戏。\n\n每次期中期末考试就像打一局吃鸡，而不同科目的差别，就像换不同的地图玩吃鸡。\n\n三好学生就像赛季的特别奖励。\n\n因此，我也分得很清楚，哪些科目有用，哪些科目没有。\n\n语文数学外语，这三门是有用的，好好学。社会、地理、自然，这些是没用的，听也不听。\n\n主要精力都放在踢球、打篮球和玩电脑上面了。\n\n可以看出，小学时的我，学到了知识，却没悟到道理，认知没怎么升级。\n\n## 错位\n\n这个误区一直持续到我上高三，它不断地发展、恶化，导致：\n\n语文：\n\n- 学语文不是语文，变成背字、背句子\n- 阅读理解不是阅读理解，变成找诀窍、猜规律\n- 作文只能写记叙文，写不了议论文，认知太浅\n\n数学：\n\n- 简单的题目一眼就能看出，不怎么用动脑\n- 复杂的题目找不出规律，领略不出其中的妙处\n\n英语：\n\n- 背单词，背了就忘，忘了再背\n- 阅读理解，文章没看懂，正确率确能达到 80%\n\n## 化学\n\n真正我让实现顿悟的，是高三时学化学。\n\n我的高中时不幸患了抑郁症，高一高二两年都成绩垫底。高三时开始一轮复习了，我才恢复过来，开始从零基础学习。\n\n说到这里，有件往事给我印象很深，一轮复习时化学张老师点我上黑板，写电解氯化钠的化学式。我洋洋洒洒地写下：\n\n> 2NaCl =通电=> 2Na + Cl_2↑\n\n当时的场景让我毕生难忘：\n\n- 经久不息的哄笑\n- 老师绝望的表情\n\n我倒不是那种怀恨在心的人，只感觉很羞愧、很丢人，这就是高三一轮复习时我的基础。\n\n我的学习方法非常的蠢：\n\n上课时就像复印机一样，把老师的板书 100% 记在笔记上。不仅是板书，老师强调的重点再在笔记上标注。上课全班就我忙不迭地动笔，别人嫌简单都很轻松。\n\n我还建立了错题本，只要是错题，题目、题图、错误的解答、错在哪里、正确的解答、错误反思，一并记录在错题本上。\n\n于是我就得到了一摞错题本，每天反复看。这个错题本最后变成了高中化学试题大全……\n\n有一天我突然就开窍了，突然就知道该怎么学化学了。\n\n自从顿悟的那一刻开始，我的化学成绩就直线上升。化学试卷中最难的题目，就是描述一大堆乱七八糟的，只给一部分线索，然后问你各是什么物质。最后我都能够读完题就把答案写出。\n\n临近高考时有一次全班考试，我闹肚子实在憋不住，提前一刻钟交卷（题目很难，好多人都还没做完）。结果那次几乎考了满分，同学们的赞叹和老师的赞赏，让我很感激。\n\n特别是我的化学老师，知道我很努力，对我很好。\n\n## 盲目的大学学习\n\n化学学习让我在学习方法上有所顿悟，但是我的认知却还是没有太大升级。\n\n直到我上大学，学习就是为了考试，应试教育把我害苦了。\n\n苦在哪里？用流行语来说，就是这样的学习它**没有灵魂**啊。\n\n虽然大学学习高数的时候。两本《高数（第五版）》加上基本从二手书店买的习题册，也学得津津有味，但是我也有很多遗憾：\n\n- 只学数学，未学数学史，建立不了深厚的感情，也没有主动地去探索遨游式学习\n- 像电路学科，一直想通过写仿真程序来仿真，但是因为太难没学会而放弃了\n- 像电机拖动这门课，电机的磁场分布是个谜，一直想写个程序把磁场画出来，但是因为太难没学会而放弃了\n- 像模电、数电，就更不用说了，有计算机仿真的话会好玩很多，虽然有仿真课，但是还是远远不够\n\n大学的学习，可以看出我探索的心有了，但是能力是真差，干啥啥不行。\n\n那时的我心气还挺高，天天读民国、批判高等教育的书籍，比较愤青，因此情绪也长期不正常。\n\n不过不论怎么说，总算在认知上是有所启蒙了。没错，我二十多岁，终于才在学习上启蒙了。\n\n## 本科学习的转机\n\n真正让我实现转变的有两门课。\n\n一门是线性代数。\n\n不得不说大学的线性代数真是坑。线性代数、空间变换之美一点没教给你，天天教的、考得是怎么手算矩阵运算。但是这门课我学地出奇的好，咋回事呢？\n\n首先，手算矩阵是非常繁琐、容易出错的。大部分同学的时间都花费在重复算、验证计算过程上面（怎么算都算不对）。\n\n而我呢，终于有一项学会计算机仿真了，当时是使用 Linux 下的 Octave（Matlab 的 Open Source 替代）。\n\n于是我的中间步骤全是靠程序自动算的，这就大大加快了我的速度，在同样时间内我能做更多的题，获得更多的锻炼。\n\n第二，是我在暑假的时候，学习了很多外国的教材，有吉尔伯特教授的公开课，也有一些国外的课本。\n\n结果让我大开眼界。当然，那时候认知能力有限，也几乎没学明白。也就模糊地明白了一点：国外教的牛逼，课本教的好 Low。\n\n一门是 C 语言。\n\n编程真的是穷困屌丝居家旅行逆袭的利器。\n\n我的大学 C 语言老师教的是 C 语言在大陆独有的一种方言——PPT C。 \n\n那时正流行考计算机证，我一次性考了三个（全国计算机二级 C、江苏计算机二级 C、江苏计算机三级偏硬，即计算机体系结构），虽然说也没啥卵用……\n\n那时我开始捣鼓 Linux，学 Linux 系统编程、C 语言、Python……玩得不亦乐乎。\n\n正是对编程的学习，锻炼了我的心智，锻炼了我的逻辑思维能力，同时锻炼了我的自学能力、探索能力。也促使我最终走向计算机这个行业。\n\n学了编程之后，我才算开窍了。这已经是大四的事情了，那年我 22 岁，刚学会学习，肚子里空空如也。\n\n## 硕士遨游在数学的世界里\n\n因为肚子里空空如也，所以我又读了个硕士（很水的）。当时在学习上刚刚开窍，为了进一步启发自己的心智，我就选择了一个纯数学算法相关的方向（非线性滤波）。\n\n在我们实验室里只有一个师兄会这个，他给我讲解了几篇论文，将我带入这个领域，我很感激他。\n\n当然，硕士更多的是需要自学。\n\n统计、统计信号处理、统计估计、卡尔曼滤波、高斯滤波……这几门课程全凭自学（就算开课，老师也不好好讲，学生也不好好上课，风气如此）。因此我全靠啃各种中英文的教材，等学会了，也活生生地被扒了一层皮。\n\n等研二开题后，开始看论文的时候，纯英文的论文又把我的肉给扒去了。看英文论文跟做英文阅读理解有本质的区别，英文阅读理只要 4 个选项里面选一个对的就行，而阅读论文是你得真看懂，能看出对错、好坏，还得能跟其他论文、知识点关联起来。\n\n论文看得差不多了就开始写论文、做仿真，把我的骨头也给扒走了……在经历了别人都发了论文我还没发，投了论文被拒，投了论文要改、改了再改……当然期刊都不是国际著名的期刊，不过我可以保证我没有作假。\n\n那时小湖边是我常去的地方，带一瓶可乐，在小湖边一坐就是一下午。湖边的芦苇长到一人多高，一大丛一大丛的，湖水波光粼粼，现在想来美如画，只不过当时没有心情欣赏。\n\n这段硕士经历将我的学习能力锻炼地更进一步。有点像把不太会游泳的人扔进水里，在水里一边挣扎一边学游泳，最后能够游得怡然自得。\n\n## 工作之后坚持学习\n\n我的学习能力不敢说有多么厉害，但是比起过去的我来说要强太多。总结起来属于把自己从一个废人的边缘拯救回来了。\n\n转眼工作快三年了，这三年最大的成就是一直没有中断过学习。\n\n坚持到什么程度呢？**每天学、每个周末学、放假学、连续学，这十年来没有中断超过十日不学习的。**\n\n因此我在职业上成长算是比较快的，也十分有潜力。\n\n工作之后，在程序员这个职业中，只要你坚持学习，就能超越相当一部分人。\n\n想要拔尖还是很困难的，还是需要不断地自我磨炼。\n\n工作之后才体会到当学生时那种学习的环境是多么好。不用担心生机、也不用担心生活、买房、生孩子。无忧无虑，一心向学。\n\n不过大学里能意识到，并开展有意义的学习的人，是极少数。我也没有好好珍惜。\n\n工作之后，成家立业、买房生子，老的老小的小。这种感觉就像冰雨猛烈地打在你的脸上，任你乐意不乐意，就那么敲打着你。\n\n压力变大了，诱惑变多了。毕竟挣了两个小钱，享乐的东西就多了。以前买不起游戏机现在可以买了，以前吃不起大餐，现在可以吃了。\n\n工作后学习的难点，我想就是顶得住压力、经得住诱惑，坚持不懈地继续学习吧！\n\n## 深度优先还是广度优先\n\n在大学里学习是先广后专呢？还是先专后广呢？我在这个问题上吃了亏。\n\n首先我们排除非黑即白，只专不广、只广不专，都不太符合现在的社会，尤其是后者，这不就是典型的键盘侠么……\n\n我们就用二八法则来划分把，留两个选项：是 80% 专 20% 广呢，还是 80% 广 20% 专呢？\n\n我走的是后面这条路。\n\n为什么呢？后面这条路一是好玩（五彩斑斓），而是容易（熟练掌握各种语言的 Helloworld）。\n\n在找工作时我就开始吃亏了。因为自己什么都知道一点，什么都不精，都不知道自己能干什么，想找一个什么样的工作。\n\n幸好当时正在流行 Android 开发热，于是自己苦学了一段时间 Android 开发，才赶上了这趟末班车，从事了这个职业。\n\n随着工作的这几年，自己的经验不断积累，不断在 Android 开发领域精进，我才幡然醒悟了一个道理：\n\n- 当你做一件事做精做强之后，你的认知能力也会随之提升，到时候再学别的，由于认知能力变高了，因此学得会快\n- 而假设你贪多嚼不烂的话，认知能力始终是那么一点，学什么都会很费劲\n\n因此，现在再让我来看的话，兴趣广点不是坏事，但是一定要专注于一项，有一个一技之长。\n\n到时候找工作的时候，能凭借这一技之长找个好工作，拿一个高薪。\n\n这一点我就吃亏了，我属于白菜价入行的……第一份工作的薪水很重要，如果这份薪水高，调薪时就会越长越多，如果起薪低，就会长得很慢。\n\n而你三十岁正是用钱的时候，结婚、买房子、生小孩都需要钱。没钱就有愁不完的烦恼。\n\n所以说，如果凭借一技之长，找一份好工作，薪水高一些，相对地生活压力就小一些，就会为生计少奔波一些。这样会额外省出一些精力，拿这些精力再去往广发展，同时也有了更高的认知能力，因此会达到贪多嚼不烂无所企及的高度。\n\n甚至说，凭借一技之长能够更快实现财务自由，到时候想干啥都行……\n\n## 未来展望\n\n我目前对未来的成长规划是这么打算的：\n\n首先，我在深度上还是需要补课的。在众多技术中我选择了 React Native。未来我打算参与 React Native 社区，与社区共成长。\n\n参与开源社区是一种快速成长的好方式。\n\n第二，业余时间里我打算多开发点程序，做些对人们有所帮助的程序，希望能赚到钱。"},"path":"post/ShouldHaveKnown2md"}
