{"template":"/home/maxiee/Code/Blog/maxiee.github.io/src/pages/post","sharedHashesByProp":{},"data":{"post":{"name":"Maxiee 随感2：放置手游中的人生哲理","desc":"在家办公憋着太无聊，想找个手游解闷。找了一个放置类手游，名字就不说了，以免被误解是软文。让我意想不到的是，这种游戏对人性的见解很深刻，蕴含了很深的人生哲理。其中有些道理，甚至是我经过多年奋斗打拼，走过一些弯路才换来的。于是，我在一个无脑手游里，开展了对人生哲学的探索之路……","type":"md","link":"GameAndLifemd","create":"2020-03-21","filename":"GameAndLife.md"},"content":"## 前言\n\n在家办公憋着太无聊，想找个手游解闷。找了一个放置类手游，名字就不说了，以免被误解是软文。让我意想不到的是，这种游戏对人性的见解很深刻，蕴含了很深的人生哲理。其中有些道理，甚至是我经过多年奋斗打拼，走过一些弯路才换来的。于是，我在一个无脑手游里，开展了对人生哲学的探索之路……\n\n## 放置类游戏\n\n什么是放置类游戏？好多人可能不了解，先简单介绍一下。\n\n回到十年、二十年前，那时有石器时代、传奇、魔兽世界。那时升级需要打怪，打装备抓宝宝需要下副本。想要变强只有一个方法，靠自己成宿熬夜肝出来。\n\n慢慢地，这类游戏不流行了，可能是因为人们的生活节奏变快，没那么多时间精力打怪了。于是有国产网游推出了自动挂机功能，开着游戏不用自己玩，程序自动帮玩家打怪捡装备。\n\n不知何时偷菜游戏火起来了。买种子种地，等上几天时间收获果实，卖出后买更多田地种子。偷菜就是一种放置类游戏，结合社交玩法当时火的不行。\n\n这种模式也被迁移到 MMORPG 游戏上，推出了离线挂机玩法。升级跟种菜一样，每分钟获得多少经验都是固定的。玩家平时不用玩，上线后直接收获战果即可。我玩的就是这一种。\n\n## 不占用时间\n\n这种游戏最大的好处是不占用时间，这也是我玩它的原因。以前我玩一个踢球的手游，打天梯经常不知不觉就打一个通宵，第二天直接去上班，难受得要死。\n\n为啥说不占用时间呢？每天上来收获下战果，给英雄升升级，做做活动，你会发现就没有内容可以玩了。想打更高级 Boss？英雄等级太低打不过。想给英雄升级？经验用光了，只能等明天产出新的经验。啥也干不了，因此玩不了一个小时，只能退出。\n\n这很符合我的要求，找点乐子，又不要占用太多时间，还能一直玩下去。\n\n## 平日学习\n\n我每天都会学习，十年如一日，极少间断。自从工作后，时间变少了。\n\n平日要上班，因此只能早起或者睡前学习，每天也只有一个小时左右。时间一到，要么上班，要么睡觉。\n\n## 每天一小时\n\n有一天，我玩完游戏准备开始学习，突然发现两者存在一定的共性：学习和游戏，都是一天只能进行一个小时的活动，他们之间有关联吗？\n\n在游戏中，通过每天玩儿，我的英雄一天天厉害起来，过了一关又一关。虽然也时常被关卡困住，但通过坚持，尝试不同英雄组合，并随着能力的积累，最终终能度过。\n\n在学习过程中，其实每天一小时能学到的东西是很少的。但是长时间积累会量变引起质变。由于是学习新事物，几乎每一步都会被困住。同样也是通过坚持，不断尝试，或者通过大量积累基础知识，少则数天，多则一年，最终也能弄通。\n\n对比来看，两者本质上是一致的。\n\n区别在于游戏是给人带来快乐的，因此在挑战与成就感之间有一个平衡。哪怕是骗人氪金的手游，也得有一个难度底线的，否则大家会觉得不好玩，玩不下去。\n\n而学习这件事，是会给人带来大量痛苦的。尽管学习也会带来快乐，但那是一种高级快乐，一种建立在痛苦之上的快乐。从某种程度上来说，爱学习的人都是高尚的自虐狂。\n\n同时，学习的进展是很缓慢的，没有游戏那么快、那么明显。学习的过程更多是潜移默化的，没有一个明确的“关”去过。\n\n总结来说，游戏可以看做是简化版、无痛版的学习精进过程。\n\n## 循序渐进\n\n游戏让我清晰地看到循序渐进的重要性。而为了悟出这个道理，我曾花了许多年，走过很多弯路。\n\n循序渐进，看似是一个很简单的道理，其实做起来并不容易。\n\n人是很容易急功近利的，尤其是身处一些具体的环境当中。比如，做一款产品，想尽快上线盈利。\n\n这件事情的难度，在于对人心智的考验。\n\n心态的失衡，会从这些点开始：\n\n- 三分钟热血，难以持久。想”黑匣子掰棒子“那样，走一路丢一路。\n- 一腔热血来了，不睡觉也不吃饭，让自己身心落入极度疲惫，理智下降\n- 无法以足够的理智与平静面对挫折，对挫折出现过度反应\n\n这些点往复出现，让人一步步走向失衡与偏执。\n\n游戏帮我重新审视这件事情。\n\n在游戏中，资源是固定的。每天就那么点经验，用完了就完了，没法透支明天的（除非氪金，不过我并不打算在这游戏上花钱）。\n\n正是这种资源限制，让我变得不急不躁。这让我体验到一种健康的作息习惯，在保持持久兴趣的同时，心态保持平和，既不狂热，也不痛苦。\n\n这游戏玩了几个礼拜，我还仍然坚持着，兴趣不减。在游戏中，见证自己通过每日点滴努力，变得越来越强，收获了很多的成就感，这是循序渐进的力量。\n\n## 遇到挫折\n\n游戏的进程不是一帆风顺的，对于免费玩家而言，游戏进程会越来越难，迫使玩家去充钱变强。\n\n经常会遇到一些关卡，怎么打都打不过去，连续几天都是如此，就算每天都能给英雄升级，也还是打不过。显然我遇到了挫折。\n\n为了克服它，我上网查阅了一些攻略，意识到自己的英雄组合并非最佳策略。在游戏中重置英雄需要花费一种宝贵资源，这种资源每天产出很少。于是为了调整组合，每次会花费近一周的时间重连，再次期间游戏进度是停滞不前的，只有每天领取的一些经验。\n\n通过不断试错，以及抽出更强大的英雄，这些关卡最终都被成功突破过去了。\n\n学习新知识中遇到的挫折比游戏中多得多，过去这些年我也突破了无数挫折。但是我感觉，每次突破学习中的挫折都要更”累“一些，我想关键还是在于心态上。\n\n游戏关卡虽然也会困住我一到两周的时间，但是我始终保持了心态的平和。\n\n其一，我想是因为心理预期。我对这个游戏本身没有任何预期，我并不要求今天必须过哪一关，或者哪天前必须要达到某种程度。这种无逾期让我没有心理负担，这种心理更加适合应对挫折。而在每天的学习中，我都会设立一个明确必须要当日完成的目标，当不可控因素出现，导致目标难以达成时，就会心态失衡。\n\n其二，我想是因为专一。我每天安排固定的时间玩游戏，这使我避免了切换上下文。而在学习时，我的兴趣老飘忽不定，导致大量精力都耗费在上下文切换上，还没开始学习，就已经很”累“了。\n\n心态平和会产生正向反馈，也就是所谓的”宁静致远“，心态越平和，越能合理面对挫折；而合理面对挫折，会有利于在克服它时不由于非理性原因浪费时间；理性克服挫折，又会加强自信、促进心态平和。\n\n而心态失衡会出现崩溃效应，失衡会导致非理性，非理性会降低效率，同时会造成自我苛责，理智下降，表现降低。这是一个快速下降的过程，直到生活出现失控。生活一旦失控，只能从头再来，如此反复。\n\n## 时间\n\n这让我意识到，之前在解决困难时，自己忽视了时间的重要性。\n\n所谓困难，是自己的逻辑认知出现了矛盾，找不到解。\n\n解决困难的方式，是找到这个解，增进自己的认知，为这个矛盾找到符合逻辑的解法。\n\n但问题是，人的认知是有限的、主观的，这就好像盲人摸象，旁人一看便知是怎么回事，但是对于摸象人而言，对于象是什么模样是很困惑的，也很难以实现。\n\n以前，当我面临这种情况时，会感到很崩溃。心理很着急，很受挫，同时也很无助。有的时候会因此而脾气败坏。\n\n现在我有了新的看法。当面临这种困境的时候，要把问题交给时间。\n\n曾经看到一句话：”所有的问题，都是时间问题“。\n\n在我的过往经历中，所有学习中遇到的困难，无不是通过不断探索、尝试最终都解决了。如果没有当时的那些”生气“，”着急“，问题解决的速度还能再快些。\n\n现在，当我再面临困境，我会安慰自己：”遇到挫折是正常的，我的能力是有限的，不要难过，让我们将它付诸时间，锲而不舍，等待时间给我们答案即可。“\n\n## 想要变强吗\n\n虽然我把这个游戏当做单机游戏在玩，不过它其实是一个网游，也存在玩家与玩家之间相互比拼的环节。这个游戏的竞争环节也值得思考。\n\n放置类游戏不同于竞技游戏。对于竞技游戏，尤其是公平竞技游戏，玩家取得胜利的一个重要因素是游戏水平。\n\n比如我之前玩的踢球游戏，在于玩家对战的时候，虽然球员培养也很关键，但是个人的操作，比如进攻、配合、防守，以及带球、传球、射门技术都更加关键。经常会碰到大神，用弱队完虐强队。\n\n但是在放置类游戏中，几乎不存在个人操作这个因素。对于所有人，获取到的经验都是一定的，变量在于策略和抽卡的欧气。而这类游戏的策略一般比较简单，玩家只需要通过简单学习，就能找到一个较优策略。而抽卡有保底机制，从长久来看非洲玩家与欧洲玩家的差距也会逐步缩小。\n\n因此，对于不氪金的玩家而言，想要竞争的关键因素在于每天把任务做好、活动做好，把系统派发的资源利用充分。谁勤奋谁就强，谁偷懒了，谁就落后了。\n\n对于氪金玩家而言，前面这些都可以忽略了。有钱，就能在游戏中攫取额外的资源。同一时间里，别人上限只能升10级，而你能升多少级取决于你的钱包。\n\n显然，这导致了阶级的分化，出现了两个阶级：\n\n第一类是劳苦大众，勤勤恳恳，每天打卡上班，把该做的做好。同时心中自知自己的位置，安贫乐道。\n\n第二类是大罗神仙，英雄、装备都是神仙级别，热衷于相互攀比，神仙打架。\n\n同样一个游戏，存在两种完全不同的玩法。这让我感到很熟悉，现实世界不就是这样吗？\n\n## 起跑线\n\n起跑线是真实存在的。有资源和没资源的人，站在同一个地点，看到的是两片天地。\n\n比如我的理想是成为一名独立开发者，但是我所处的现实是，有房贷要还，还想多挣点钱为以后生小孩做准备，同时也想未来买辆车。这些现实导致我必须工作，并将大量时间投入到升职、加薪上。\n\n我也幻想说老爸突然有一天，给我个几百万，让我去追求梦想。就像段子里说的，估计我爸还在等我爷爷给他几百万呢。\n\n我也佩服那些放弃世俗追求理想的人，打自心底的佩服，同时也羡慕。这是真正活明白的人。我在这方面其实是非常普通平凡的，这会让我距离理想更远一些。不过我心里觉得远点没关系，有就行。\n\n所谓的人穷志短，其实是一种无可奈何的状况。”穷“不是没钱的意思，”贫“才是没钱的意思，”穷“的意思是走投无路，也就是没有资源。\n\n安贫乐道吧，别多想。\n\n## 有资源是什么样\n\n我有一个爱好，就是喜欢数码产品。在穿上完全不讲究，迪卡侬99元一双的鞋就足够了。我会把剩下来的钱买各种的电脑、电子设备。\n\n每次出门最让我头疼的就是机场安检，每次我都会从书包里掏出三四台电脑，两个手机。然后接收安检人员看傻子、看特务、看骇客的奇怪眼神。最后还要手忙脚乱地把这些收回书包里，清点一下不要落下。\n\n因此，在数码产品方面，我是一个有资源的人。\n\n我还记得我在学生时代，当时只有一台 EeePC 小电脑。那时为了学习 Linux，便在 EeePC 上装了一个 Ubuntu。在 Ubuntu 下想要做笔记、打字，同时获得一个高使用体验是不容易的。免不了各种折腾，使用各种神奇的软件，比如 Zim。浪费很多现在来看不必要的时间。\n\n后来我换了一台神船笔记本，听人说 macOS 好，于是又花了大量时间折腾黑苹果。好不容易折腾上去，体验与正版的也相距甚远。\n\n如果换在现在，这件事情变得非常简单。直接去买三台电脑：一台 rmbp，一台 Windows 笔记本，一台台式机装 Linux。都摆在桌子上，macOS 做笔记好就用它专门查资料做笔记。Linux 就专门做实验就完了。从中可见，能节省多少折腾的时间。\n\n我觉得，年轻的时候多折腾是好事，岁数大了能花钱就少折腾。\n\n## 小结\n\n原本只是想找个游戏解闷来着，万万想到悟出这么多人生哲理。既惊喜有意外。"},"path":"post/GameAndLifemd"}
